mcSimoffa/nRF51_BLE_nucleometer/firmware/src/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}



/*! ---------------------------------------------------------------------------
  \brief Function provides a timestamp for log module
  \details app_time_Init() should be invoked before using

  \return milliseconds value after system start (RTC1 was started)
 ----------------------------------------------------------------------------*/
static uint32_t log_time_provider()
{
  timestr_t log_timestr;
  app_time_Ticks_to_struct(app_time_Get_sys_time(), &log_timestr);
  return (log_timestr.sec*1000 + log_timestr.ms);
}

/*!  ---------------------------------------------------------------------------
  \brief Function for application main entry.``
 ---------------------------------------------------------------------------  */
int main(void)
{
  common_drv_init();
  app_time_Init();

  ret_code_t err_code = NRF_LOG_INIT(log_time_provider);
  ASSERT(err_code == NRF_SUCCESS);
  
  CPU_usage_Startup();

  HV_pump_Init();
  particle_cnt_Init();
  
  particle_cnt_Startup();
  HV_pump_Startup();
  
#if 000
  timers_init();
  buttons_leds_init(&erase_bonds);
  ble_stack_init();
  peer_manager_init(erase_bonds);
  if (erase_bonds == true)
  {
    NRF_LOG_INFO("Bonds erased!\r\n");
  }
  gap_params_init();
  advertising_init();
  services_init();
  conn_params_init();

  // Start execution.
  application_timers_start();
  advertising_start();
#endif

  // Enter main loop.
  while (true)
  {
    if (NRF_LOG_PROCESS() == false)
    {
      CPU_usage_Sleep();
    }
  }
}
